GoCardlessSDK/Example/Tests/billing_request_payment_only.json

{
  "billing_requests": {
    "id": "BRQ0005VSW88XMW",
    "created_at": "2024-03-11T17:22:11.090Z",
    "status": "pending",
    "mandate_request": null,
    "payment_request": {
      "description": "Unbranded Wooden Tuna",
      "currency": "GBP",
      "amount": 4254,
      "min_amount": null,
      "max_amount": null,
      "default_min_amount": null,
      "default_max_amount": null,
      "app_fee": null,
      "scheme": "faster_payments",
      "links": {},
      "metadata": {
        "postman": "payment-only-br"
      },
      "flexible_amount": false
    },
    "metadata": {
      "test": "BR766"
    },
    "links": {
      "customer": "CU001443JYM9YT",
      "customer_billing_detail": "CBD000J8BXSXQGK",
      "creditor": "CR00007J0CSSJG",
      "organisation": "OR00005F8R8W8Y",
      "payment_request": "PRQ0000QY079FR1"
    },
    "fallback_enabled": false,
    "fallback_occurred": false,
    "sign_flow_url": null,
    "creditor_name": "GunhanOrg",
    "actions": [
      {
        "type": "choose_currency",
        "required": true,
        "completes_actions": [],
        "requires_actions": [],
        "status": "completed",
        "available_currencies": [
          "GBP",
          "AUD",
          "EUR"
        ]
      },
      {
        "type": "collect_amount",
        "required": true,
        "completes_actions": [],
        "requires_actions": [],
        "status": "completed"
      },
      {
        "type": "collect_customer_details",
        "required": true,
        "completes_actions": [],
        "requires_actions": [
          "choose_currency",
          "collect_amount"
        ],
        "status": "pending",
        "collect_customer_details": {
          "incomplete_fields": {
            "customer": [
              "email",
              "given_name",
              "family_name"
            ],
            "customer_billing_detail": []
          },
          "default_country_code": "GB"
        }
      },
      {
        "type": "select_institution",
        "required": true,
        "completes_actions": [],
        "requires_actions": [],
        "status": "pending",
        "institution_guess_status": "pending"
      },
      {
        "type": "collect_bank_account",
        "required": true,
        "completes_actions": [
          "choose_currency"
        ],
        "available_country_codes": [
          "GB"
        ],
        "requires_actions": [
          "collect_amount"
        ],
        "status": "pending"
      },
      {
        "type": "bank_authorisation",
        "required": true,
        "completes_actions": [],
        "requires_actions": [
          "select_institution"
        ],
        "status": "pending",
        "bank_authorisation": {
          "authorisation_type": "payment",
          "adapter": "open_banking_gateway_pis"
        }
      }
    ],
    "resources": {
      "customer": {
        "id": "CU001443JYM9YT",
        "created_at": "2024-03-11T17:22:11.063Z",
        "email": null,
        "given_name": null,
        "family_name": null,
        "company_name": null,
        "language": "en",
        "phone_number": null,
        "metadata": {}
      },
      "customer_billing_detail": {
        "id": "CBD000J8BXSXQGK",
        "created_at": "2024-03-11T17:22:11.080Z",
        "address_line1": null,
        "address_line2": null,
        "address_line3": null,
        "city": null,
        "region": null,
        "postal_code": null,
        "country_code": null,
        "swedish_identity_number": null,
        "danish_identity_number": null
      }
    },
    "experimentation": {
      "is_eligible_for_share_of_wallet_experiments": true,
      "is_eligible_for_optional_vm_experiments": false,
      "is_eligible_for_institution_experiments": false,
      "is_eligible_for_ach_optional_address_experiments": false,
      "is_eligible_for_single_tab_experiments": false,
      "is_eligible_for_bankid_safe_start_experiments": false
    }
  }
}